# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [23]:
import random
serie1 = pd.Series(random.randint(1,5))
serie2 = pd.Series(random.randint(1,4))
serie3 = pd.Series(random.randint(10000,30000))

print(serie1,serie2,serie3)

0    5
dtype: int64 0    4
dtype: int64 0    18412
dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [26]:
join_column = pd.concat([serie1,serie2,serie3], axis = 1)
join_column

   0  1      2
0  5  4  18412

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [28]:
join_column.rename(columns= {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'},inplace=True)
join_column

   bedrs  bathrs  price_sqr_meter
0      5       4            18412

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299